In [1]:
%load_ext sql

In [4]:
%sql sqlite:///Northwind.db

In [3]:
!pip install pandas sqlalchemy mysql-connector-python

Requirement already satisfied: pandas in c:\users\dell\anaconda3\envs\sql_env\lib\site-packages (2.3.0)
Requirement already satisfied: sqlalchemy in c:\users\dell\anaconda3\envs\sql_env\lib\site-packages (2.0.41)
Requirement already satisfied: mysql-connector-python in c:\users\dell\anaconda3\envs\sql_env\lib\site-packages (9.3.0)
Requirement already satisfied: numpy>=1.22.4 in c:\users\dell\anaconda3\envs\sql_env\lib\site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\anaconda3\envs\sql_env\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\anaconda3\envs\sql_env\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dell\anaconda3\envs\sql_env\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: greenlet>=1 in c:\users\dell\anaconda3\envs\sql_env\lib\site-packages (from sqlalchemy) (3.2.3)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\dell\anaconda3\envs\sql_env\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: six>=1.5 in c:\users\dell\anaconda3\envs\sql_env\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [6]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
%sql mysql+pymysql://root:20056@localhost/Northwind

In [6]:
%%sql 
SELECT 
* 
FROM 
    Employee ;

 * mysql+pymysql://root:***@localhost/Northwind
   sqlite:///Northwind.db
2 rows affected.

[(2, 'Doe', 'Jane', 'Sales Rep', 'Mr.', datetime.datetime(1976, 6, 17, 0, 0), datetime.datetime(2012, 9, 22, 0, 0), '661 Main St', 'Houston', 'Region 2', '34658', 'Canada', '451-5059', '992', 'No notes', 5, 'photos/jane.jpg', 10685.2),
 (3, 'Johnson', 'Alice', 'Support', 'Ms.', datetime.datetime(1973, 11, 10, 0, 0), datetime.datetime(2005, 10, 29, 0, 0), '215 Main St', 'Los Angeles', 'Region 3', '31023', 'France', '481-7468', '807', 'No notes', 2, 'photos/alice.jpg', 7836.22)]

In [7]:
%%sql 
SELECT 
    *
FROM 
    Customers ;

 * mysql+pymysql://root:***@localhost/Northwind
   sqlite:///Northwind.db
2 rows affected.

[(1, 'Cairo Market', 'Mona Ahmed', 'Manager', '12 Nile St', 'Cairo', 'Cairo', 'Egypt', '0123456789', '0123456780'),
 (2, 'Alex Foods', 'Ali Hassan', 'Owner', '5 Sea Rd', 'Alexandria', 'Alex', 'Egypt', '0109876543', '0109876500')]

In [8]:
%%sql 
SELECT 
    unit_price , 
    discontinued 
FROM 
    products 
WHERE 
    unit_price > 30 
    AND  discontinued = 1 ;

 * mysql+pymysql://root:***@localhost/Northwind
   sqlite:///Northwind.db
5 rows affected.

[(Decimal('40.00'), b'\x01'),
 (Decimal('97.00'), b'\x01'),
 (Decimal('39.00'), b'\x01'),
 (Decimal('31.23'), b'\x01'),
 (Decimal('123.79'), b'\x01')]

In [10]:
%%sql 
SELECT 
    contact_name ,
    phone ,
    country
FROM 
    customers 
WHERE 
    country = 'USA' 
    OR country = 'Canada';

 * mysql+pymysql://root:***@localhost/Northwind
   sqlite:///Northwind.db
50 rows affected.

[('Alice Smith', '555-1001', 'USA'),
 ('Bob Johnson', '555-1002', 'USA'),
 ('Carol Lee', '555-1003', 'USA'),
 ('David Kim', '555-1004', 'USA'),
 ('Eve Davis', '555-1005', 'USA'),
 ('Zack White', '555-1006', 'USA'),
 ('Ella Brown', '555-1007', 'USA'),
 ('Tom Black', '555-1008', 'USA'),
 ('Ivy Green', '555-1009', 'USA'),
 ('Ken Blue', '555-1010', 'USA'),
 ('Liam Smith', '555-1011', 'USA'),
 ('Mia Lee', '555-1012', 'USA'),
 ('Noah Kim', '555-1013', 'USA'),
 ('Xena Davis', '555-1014', 'USA'),
 ('Oscar White', '555-1015', 'USA'),
 ('Paul Brown', '555-1016', 'USA'),
 ('Rachel Black', '555-1017', 'USA'),
 ('Sam Green', '555-1018', 'USA'),
 ('Tina Blue', '555-1019', 'USA'),
 ('Uma Smith', '555-1020', 'USA'),
 ('Phil Smith', '555-1021', 'USA'),
 ('Chloe Lee', '555-1022', 'USA'),
 ('Peter Kim', '555-1023', 'USA'),
 ('Olga Davis', '555-1024', 'USA'),
 ('Pam White', '555-1025', 'USA'),
 ('Aaron Brown', '555-1026', 'USA'),
 ('Bella Black', '555-1027', 'USA'),
 ('Carl Green', '555-1028', 'USA'),
 ('Dana Blue', '555-1029', 'USA'),
 ('Ed Smith', '555-1030', 'USA'),
 ('Fay Smith', '555-1031', 'USA'),
 ('Gina Lee', '555-1032', 'USA'),
 ('Hank Kim', '555-1033', 'USA'),
 ('Iris Davis', '555-1034', 'USA'),
 ('Jake White', '555-1035', 'USA'),
 ('Kara Brown', '555-1036', 'USA'),
 ('Lana Black', '555-1037', 'USA'),
 ('Mike Green', '555-1038', 'USA'),
 ('Nina Blue', '555-1039', 'USA'),
 ('Omar Smith', '555-1040', 'USA'),
 ('Paul Smith', '555-1041', 'USA'),
 ('Quinn Lee', '555-1042', 'USA'),
 ('Rita Kim', '555-1043', 'USA'),
 ('Sam Davis', '555-1044', 'USA'),
 ('Tara White', '555-1045', 'USA'),
 ('Vera Brown', '555-1046', 'USA'),
 ('Will Black', '555-1047', 'USA'),
 ('Xander Green', '555-1048', 'USA'),
 ('Yara Blue', '555-1049', 'USA'),
 ('Zoe Smith', '555-1050', 'USA')]

In [16]:
%%sql
SELECT 
    first_name,
    last_name,
    city , 
    title  
FROM 
    employee
WHERE 
    (title = 'Accountant ' 
    OR title =  'Manager'
    ) 
    AND city = 'Pierre '
    OR city = 'Pittsburgh';

 * mysql+pymysql://root:***@localhost/Northwind
   sqlite:///Northwind.db
1 rows affected.

[('Chris', 'Cooper', 'Pittsburgh', 'Manager')]